---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures
source: html/e2e2f3b2-2b88-3154-a87e-fcb7a9ed98d4.htm
---
# BuiltInFailures.ColumnFailures Properties

Column and target are both concrete. Geometries have been joined.